Ввод данных и отображение вывода в требуемом формате играет важную роль в интерактивном программировании. Поэтому давайте сосредоточимся на вводе и выводе различных типов данных.

###raw_input()
эта функция используется для ввода данных до конца строки. Обратите внимание, что не должно быть пробелов. Ввод данных завершается символом новой строки, и если в строке ввода есть пробелы, это приводит к ошибке.

    # Выводит введенные в stdin данные
    astring=raw_input()# введите hello
    print raw_input()

после ввода данных мы можем преобразовать их в нужный нам тип данных, используя функции такие как int(), float(), str()

    num=int(raw_input())
    print num
    decimalnum=raw_input()
    decimalnum=float(raw_input()
    print decimalnum

###input()
эта функция особенно используется для ввода целых чисел. Преимущество input() перед raw_input() можно объяснить с помощью следующего примера

    #введите 2*2
    a=input()
    b=raw_input() #заметьте, что int(raw_input()) приводит к ошибке
    print a #печатает 4
    print b #печатает 2*2

###как взять два или более типов данных из одной строки, разделенных пробелами?
Здесь мы используем функции split() и map()

    #введите два целых числа в первой строке и более двух целых чисел в третьей строке
    a, b = map(int, raw_input().split())
    array = raw_input().split()
    sum = 0
    for each in array:
        sum = sum + int(each)
    print(a, b, sum)  # выводит первые два целых числа из первой строки и сумму целых чисел второй строки

###Форматирование вывода
Вы могли уже заметить, что оператор print автоматически вставляет новую строку. Использование запятой, как в приведенном выше коде, выводит значения в одной строке, разделенной пробелом.
Модуль sys предоставляет различные функции для форматирования вывода, но здесь мы изучим, как использовать базовые знания форматирования для вывода в нужном формате. Давайте посмотрим несколько примеров, чтобы научиться форматировать вывод.

    a = 5
    b = 0.63
    c = "hello"
    print "a is : %d, b is %0.4f,c is %s" % (a,b,c)

Выход должен быть самодостаточным.

Exercise
--------

Напишите программу, которая просит пользователя ввести их имя, возраст и страну. Программа должна затем вывести сообщение, которое включает эту информацию в предложении. Программа должна включать:

1. Ввод имени, используя `raw_input()`.
2. Ввод возраста, используя `input()`, с последующим преобразованием в целое число.
3. Ввод названия страны, используя `raw_input()`.
4. Форматирование вывода для отображения предложения, которое включает имя, возраст и страну.

Программа должна демонстрировать обработку ввода и форматирование строк в Python.