Обычно мы определяем функцию, используя ключевое слово `def` где-то в коде, и вызываем её, когда нужно.

    def sum(a, b):
        return a + b

    a = 1
    b = 2
    c = sum(a, b)
    print(c)

Теперь вместо того, чтобы определять функцию где-то и вызывать её, мы можем использовать lambda-функции Python, которые являются встроенными функциями, определяемыми прямо там, где они используются. Таким образом, нам не нужно объявлять функцию где-то и возвращаться к коду только для одноразового использования.

Им не нужно иметь имя, поэтому их также называют анонимными функциями. Мы определяем lambda-функцию, используя ключевое слово `lambda`.

    your_function_name = lambda inputs : output

Таким образом, приведённый выше пример сложения с использованием lambda-функции выглядел бы так:

    a = 1
    b = 2
    sum = lambda x, y : x + y
    c = sum(a, b)
    print(c)

Здесь мы присваиваем lambda-функцию переменной **sum**, и при передаче аргументов, то есть `a` и `b`, она работает как обычная функция.

Exercise
--------
Напишите программу, используя lambda-функции, для проверки, является ли число в заданном списке нечётным. Выведите "True", если число нечётное, или "False", если нет, для каждого элемента.